---
type: TableCellCombinedParameterData
namespace: Autodesk.Revit.DB
version: 2024
members: 9
tags: [revit-api, class]
---

# TableCellCombinedParameterData

`Autodesk.Revit.DB.TableCellCombinedParameterData` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2017 | `public static TableCellCombinedParameterData Create ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CategoryId | — | `public ElementId CategoryId { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ParamId | — | `public ElementId ParamId { get ; set ; }` |
| Property | Prefix | — | `public string Prefix { get ; set ; }` |
| Property | SampleValue | — | `public string SampleValue { get ; set ; }` |
| Property | Separator | — | `public string Separator { get ; set ; }` |
| Property | Suffix | — | `public string Suffix { get ; set ; }` |